:PROPERTIES:
:ID:       601854a4-237e-49a7-a0b7-e15e7bf08726
:END:
#+TITLE: Electron emission
#+FILETAGS: :problem: :SPOP: :statmech:
#+SETUPFILE: ~/.config/emacs/setup/setupfile.org
#+BEGIN: clocktable :maxlevel 2 :scope nil :emphasize nil
#+CAPTION: Clock summary at [2024-04-25 Thu 18:34]
| Headline               | Time   |
|------------------------+--------|
| *Total time*           | *0:43* |
|------------------------+--------|
| 3.16 Electron emission | 0:43   |
#+END
* 3.16 Electron emission
:LOGBOOK:
CLOCK: [2024-04-25 Thu 17:49]--[2024-04-25 Thu 18:32] =>  0:43
:END:
*When a metal is heated in vacuum, electrons are emitted from its surface. The metal is modeled as a classical gas of non-interacting electrons held in the solid by an abrupt potential well of depth* \(\phi\) *(the work-function) relative to the vacuum.*

Next: [[id:2eea2039-7175-4635-8256-224892e7134e][Classical harmonic oscillators]]

** 3.16.1
*What is the relationship between the initial and final velocities of an escaping electron?*

\[2^{-1} m_e (v_f^2 - v_i^2) = \phi \Rightarrow v_f= \big[v_i{ }^2+ (2 \phi/m_e)\big]^{1/2}.\]

** 3.16.2
*In thermal equilibrium at temperature* \(T\), *what is the probability density function for the velocity of electrons?*

As obtained in the problem [[id:df72e834-3e97-490b-93b6-bcbc6d85e4c0][Effusion]] (3.14.1) (also see [[id:c3729898-9aa3-4966-a16c-24216deb2c8d][equilibrium properties]]),

\[f (\vec{v}_e)= \bigg(\frac{m_e}{2 \pi \,k_B T}\bigg)^{3 / 2} \exp \bigg(- \frac{m_e \, v^2}{2 k_B T} \bigg).\]

** 3.16.3
*If the number density of electrons is* \(n\), *calculate the current density of thermally emitted electrons.*

As obtained in the problem [[id:df72e834-3e97-490b-93b6-bcbc6d85e4c0][Effusion]] the [[id:ad948e53-1a7b-4c30-81cc-708f6ab74d58][current density]] \( J \) is given by

\begin{equation*}
J = 4^{-1} \, n \, \bar{v}_e, \qquad \bar{v}_e = \int_{(2 \phi / m_e)^{1/2}}^\infty v_e \, f(\vec{v}_e) \, \mathrm{d} v_e.
\end{equation*}

Apart from a change in the lower limit from \(v_t\) to \((2 \phi / m_e)^{1/2}\), the integral for \( \bar{v}_e \) is the same as the one we encountered in the previous problem [[id:d133f2ba-605b-4279-a173-4edb65e80cd0][Adsorbed particles]]. So we immediately write

\begin{align*}
\bar{v}_e = 2^{3/2} \big( \pi\, \beta \, m_e \big)^{-1/2} \big(\beta \, \phi + 1\big) \exp \big(- \beta \, \phi \big), \qquad J= 2^{-1/2} \big(\pi \, \beta \, m_e \big)^{-1/2} \big(\beta \, \phi + 1\big) \exp \big(- \beta \, \phi \big).
\end{align*}

In our expression for \(J\), the leading term in \(T\) goes like \(J \propto T^{\thinspace 1 / 2} \exp \big(-\beta \, \phi \big) + \mathcal{O} (T^{\thinspace-1/2})\), which of course differs from [[id:c01f3f40-a5b9-432a-b480-dd9582385833][Richardson's law for thermionic emission]] in which the current density shows behaviour \(J \propto T^{\thinspace 2} \, \exp (- \beta \, \phi)\).  For that, we'll have to take into account [[id:3d61b366-690a-4b0a-9200-2604eb725676][Fermi statistics]] and modify \(n_e\) suitably (taken to be a constant here).

